Tekla.Structures.Drawing.WeldMark
The WeldMark class defines a drawing object that illustrates a weld mark in a specific view.
WeldMark class refers to welding marks that appear when creating/updating drawing views. In this case, ModelIdentifier has a value.
WeldMark class also refers to weld marks created with drawing editor UI. In this case, ModelIdentifier value is zero.
Graphical representation of welding marks (line and text properties) can be modified using .wel setting files.
The welding mark settting files (.wls) cannot be used to modify instances of WeldMark class.
The following code modifies a weld mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class WeldMarkExample
{
public void WeldMarkModify()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
while (allObjectsOnSheet.MoveNext())
{
if (allObjectsOnSheet.Current is Tekla.Structures.Drawing.WeldMark)
{
WeldMark weldMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.WeldMark;
weldMark.Modify();
}
}
}
}

Tekla.Structures.Drawing.WeldMark.#ctor(System.Boolean)
Create instance of WeldMark

Tekla.Structures.Drawing.WeldMark.ModelIdentifier
When instance refers to welding mark related to a weld in model database, ModelIdentifier has a value.
When instance refers to weld mark created with drawing editor UI, value is zero.

Tekla.Structures.Drawing.WeldMark.Attributes
The attributes of the weld mark.
For more information see Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.

Tekla.Structures.Drawing.WeldMark.InsertionPoint
The insertion point of the mark.

Tekla.Structures.Drawing.WeldMark.TextWidth
The width of the text frame.

Tekla.Structures.Drawing.WeldMark.TextHeight
The height of the text frame.

Tekla.Structures.Drawing.WeldMark.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Call TS and perform database operation specified in OperationType.
OperationType: The type of the operation.

Tekla.Structures.Drawing.WeldMark.Delete
Deletes the weld mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.WeldMark.Modify
Modifies the weld mark in the current drawing database.
Attributes can be modified with .wel setting files.
Returns: True on success.

Tekla.Structures.Drawing.WeldMark.Insert
NOT YET IMPLEMENTED.
Welding marks connected with welds in the model database appear when drawing views are created/updated.
Weld marks created with drawing editor UI cannot be inserted with API code.
Returns: False.

Tekla.Structures.Drawing.WeldMark.Select
Selects the weld mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.WeldMark.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.WeldMark.GetAxisAlignedBoundingBox
Returns the axis aligned bounding box of the weld mark (rectangle format).
Returns: The bounding box of the text.

Tekla.Structures.Drawing.WeldMark.GetObjectAlignedBoundingBox
Returns the object aligned bounding box of the weld mark (rectangle format).
Returns: The bounding box of the text.

Tekla.Structures.Drawing.WeldMark.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object using the move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.WeldMark.GetObjects
Gets the children objects of the current object.
Returns: The children objects of the current object.

Tekla.Structures.Drawing.WeldMark.GetObjects(System.Type[])
Gets the children objects of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children objects of the current object that are of certain types.

Tekla.Structures.Drawing.WeldMark.Hideable
Accesses the information if this object is hidden or not or if it should be.